Repository: starcat-app/Starcat
Catalog: Starcat/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, id, it, ja, ko, nl, pl, pt_br, ru, tr, uk, vi, zh_hans, zh_hant

# rag.core.plan.error.semanticQueryMissingFormat
source: %@ is missing semanticQuery
ar: يفتقد %@ semanticQuery
de: %@ fehlt semanticQuery
es: A %@ le falta semanticQuery
fr: %@ ne contient pas semanticQuery
id: %@ tidak memiliki semanticQuery
it: A %@ manca semanticQuery
ja: %@ にsemanticQueryがありません
ko: %@에 semanticQuery가 없습니다
nl: %@ mist semanticQuery
pl: %@ brakuje semanticQuery
pt_br: %@ está faltando semanticQuery
ru: %@ не содержит semanticQuery
tr: %@ semanticQuery eksik
uk: %@ не містить semanticQuery
vi: %@ thiếu semanticQuery
zh_hans: %@ 缺少 semanticQuery
zh_hant: %@ 缺少 semanticQuery

# rag.core.plan.error.structuredConditionsMissing
source: structured_only has no structured conditions
ar: structured_only ليس له شروط منظمة
de: structured_only hat keine strukturierten Bedingungen
es: structured_only no tiene condiciones estructuradas
fr: structured_only n'a pas de conditions structurées
id: structured_only tidak memiliki kondisi terstruktur
it: structured_only non ha condizioni strutturate
ja: structured_onlyに構造化条件がありません
ko: structured_only에 구조화된 조건이 없습니다
nl: structured_only heeft geen gestructureerde voorwaarden
pl: structured_only nie ma warunków strukturalnych
pt_br: structured_only não tem condições estruturadas
ru: structured_only не содержит структурированных условий
tr: structured_only yapılandırılmış koşul içermiyor
uk: structured_only не має структурованих умов
vi: structured_only không có điều kiện có cấu trúc
zh_hans: structured_only 没有结构化条件
zh_hant: structured_only 没有结构化条件

# rag.core.plan.scope.knowledge
source: Knowledge Base
ar: قاعدة المعرفة
de: Wissensdatenbank
es: Base de conocimiento
fr: Base de connaissances
id: Basis Pengetahuan
ja: ナレッジベース
ko: 지식 베이스
nl: Kennisbank
pl: Baza wiedzy
pt_br: Base de Conhecimento
ru: База знаний
tr: Bilgi Tabanı
uk: База знань
vi: Cơ sở tri thức
zh_hans: 知识库
zh_hant: 知识库

# rag.core.remote.commitActivityFormat
source: Commits in the last 12 weeks: %1$lld; active weeks: %2$lld/%3$lld.
ar: الالتزامات في آخر 12 أسبوعًا: %1$lld؛ الأسابيع النشطة: %2$lld/%3$lld.
de: Commits in den letzten 12 Wochen: %1$lld; aktive Wochen: %2$lld/%3$lld.
es: Confirmaciones en las últimas 12 semanas: %1$lld; semanas activas: %2$lld/%3$lld.
fr: Commits au cours des 12 dernières semaines : %1$lld ; semaines actives : %2$lld/%3$lld.
id: Komit dalam 12 minggu terakhir: %1$lld; minggu aktif: %2$lld/%3$lld.
it: Commit nelle ultime 12 settimane: %1$lld; settimane attive: %2$lld/%3$lld.
ja: 過去12週間のコミット: %1$lld; アクティブな週: %2$lld/%3$lld。
ko: 지난 12주 동안의 커밋: %1$lld; 활동 주: %2$lld/%3$lld.
nl: Commits in de laatste 12 weken: %1$lld; actieve weken: %2$lld/%3$lld.
pl: Commity w ciągu ostatnich 12 tygodni: %1$lld; aktywne tygodnie: %2$lld/%3$lld.
pt_br: Commits nas últimas 12 semanas: %1$lld; semanas ativas: %2$lld/%3$lld.
ru: Коммитов за последние 12 недель: %1$lld; активных недель: %2$lld/%3$lld.
tr: Son 12 haftadaki commit'ler: %1$lld; aktif haftalar: %2$lld/%3$lld.
uk: Комітів за останні 12 тижнів: %1$lld; активних тижнів: %2$lld/%3$lld.
vi: Số commit trong 12 tuần qua: %1$lld; số tuần hoạt động: %2$lld/%3$lld.
zh_hans: 最近 12 周 commits=%1$lld，活跃周数=%2$lld/%3$lld。
zh_hant: 最近 12 周 commits=%1$lld，活跃周数=%2$lld/%3$lld。

# rag.core.remote.empty.contributors
source: No public contributor data is available.
ar: لا تتوفر بيانات عامة عن المساهمين.
de: Keine öffentlichen Beitragsdaten verfügbar.
es: No hay datos públicos de contribuyentes disponibles.
fr: Aucune donnée publique sur les contributeurs n'est disponible.
id: Tidak ada data kontributor publik yang tersedia.
it: Nessun dato pubblico sui contributori disponibile.
ja: 公開コントリビューターデータは利用できません。
ko: 공개 기여자 데이터를 사용할 수 없습니다.
nl: Geen openbare bijdragersgegevens beschikbaar.
pl: Brak dostępnych danych publicznych współtwórców.
pt_br: Nenhum dado público de contribuidores disponível.
ru: Нет доступных публичных данных об участниках.
tr: Herhangi bir herkese açık katkıda bulunan verisi mevcut değil.
uk: Немає загальнодоступних даних про учасників.
vi: Không có dữ liệu người đóng góp công khai.
zh_hans: 没有可用的公开贡献者数据。
zh_hant: 没有可用的公开贡献者数据。

# rag.core.remote.empty.matches
source: No matching public results.
ar: لا توجد نتائج عامة مطابقة.
de: Keine übereinstimmenden öffentlichen Ergebnisse.
es: No hay resultados públicos coincidentes.
fr: Aucun résultat public correspondant.
id: Tidak ada hasil publik yang cocok.
it: Nessun risultato pubblico corrispondente.
ja: 一致する公開結果はありません。
ko: 일치하는 공개 결과가 없습니다.
nl: Geen overeenkomende openbare resultaten.
pl: Brak pasujących wyników publicznych.
pt_br: Nenhum resultado público correspondente.
ru: Нет соответствующих публичных результатов.
tr: Eşleşen herkese açık sonuç yok.
uk: Немає відповідних загальнодоступних результатів.
vi: Không có kết quả công khai phù hợp.
zh_hans: 没有匹配的公开结果。
zh_hant: 没有匹配的公开结果。

# rag.core.remote.empty.releases
source: The repository has no public releases.
ar: لا يحتوي المستودع على إصدارات عامة.
de: Das Repository hat keine öffentlichen Releases.
es: El repositorio no tiene versiones públicas.
fr: Le dépôt n'a pas de versions publiques.
id: Repositori tidak memiliki rilis publik.
it: Il repository non ha release pubbliche.
ja: リポジトリに公開リリースはありません。
ko: 저장소에 공개 릴리스가 없습니다.
nl: De repository heeft geen openbare releases.
pl: Repozytorium nie ma publicznych wydań.
pt_br: O repositório não tem releases públicas.
ru: Репозиторий не имеет публичных релизов.
tr: Deponun herkese açık sürümü yok.
uk: Репозиторій не має загальнодоступних релізів.
vi: Kho lưu trữ không có bản phát hành công khai.
zh_hans: 仓库没有公开 Release。
zh_hant: 仓库没有公开 Release。

# rag.core.remote.empty.securityAdvisories
source: No public repository security advisories were returned.
ar: لم يتم إرجاع أي استشارات أمان عامة للمستودع.
de: Es wurden keine öffentlichen Sicherheitshinweise des Repositorys zurückgegeben.
es: No se devolvieron avisos de seguridad públicos del repositorio.
fr: Aucun avis de sécurité public de dépôt n'a été renvoyé.
id: Tidak ada advisori keamanan repositori publik yang dikembalikan.
it: Nessun avviso di sicurezza pubblico del repository restituito.
ja: 公開リポジトリのセキュリティアドバイザリは返されませんでした。
ko: 공개 저장소 보안 권고가 반환되지 않았습니다.
nl: Geen openbare beveiligingsadviezen van de repository geretourneerd.
pl: Nie zwrócono żadnych publicznych doradztw bezpieczeństwa repozytorium.
pt_br: Nenhum aviso de segurança público do repositório foi retornado.
ru: Не получено публичных уведомлений о безопасности репозитория.
tr: Herkese açık depo güvenlik danışma belgesi döndürülmedi.
uk: Не отримано загальнодоступних сповіщень про безпеку репозиторію.
vi: Không có tư vấn bảo mật kho lưu trữ công khai nào được trả về.
zh_hans: 没有返回公开仓库安全公告。
zh_hant: 没有返回公开仓库安全公告。

# rag.core.remote.error.webSearchUnsupported
source: The GitHub provider does not support general web search
ar: لا يدعم مزود GitHub البحث العام على الويب
de: Der GitHub-Anbieter unterstützt keine allgemeine Websuche
es: El proveedor de GitHub no admite la búsqueda web general
fr: Le fournisseur GitHub ne prend pas en charge la recherche web générale
id: Penyedia GitHub tidak mendukung pencarian web umum
it: Il provider GitHub non supporta la ricerca web generale
ja: GitHubプロバイダーは一般的なウェブ検索をサポートしていません
ko: GitHub 제공자는 일반 웹 검색을 지원하지 않습니다
nl: De GitHub-provider ondersteunt geen algemeen webzoeken
pl: Dostawca GitHub nie obsługuje ogólnego wyszukiwania internetowego
pt_br: O provedor GitHub não suporta busca geral na web
ru: Провайдер GitHub не поддерживает общий веб-поиск
tr: GitHub sağlayıcısı genel web aramasını desteklemez
uk: Провайдер GitHub не підтримує загальний веб-пошук
vi: Nhà cung cấp GitHub không hỗ trợ tìm kiếm web tổng quát
zh_hans: GitHub Provider 不支持普通 Web 搜索
zh_hant: GitHub Provider 不支持普通 Web 搜索

# rag.core.service.clarificationFallback
source: Please add more query details
ar: يرجى إضافة المزيد من تفاصيل الاستعلام
de: Bitte fügen Sie weitere Abfragedetails hinzu
es: Agrega más detalles a la consulta
fr: Veuillez ajouter plus de détails à la requête
id: Silakan tambahkan detail kueri lebih lanjut
it: Aggiungi ulteriori dettagli alla query
ja: クエリの詳細を追加してください
ko: 더 많은 쿼리 세부 정보를 추가하세요
nl: Voeg meer querydetails toe
pl: Dodaj więcej szczegółów zapytania
pt_br: Por favor, adicione mais detalhes à consulta
ru: Пожалуйста, добавьте больше деталей запроса
tr: Lütfen daha fazla sorgu ayrıntısı ekleyin
uk: Будь ласка, додайте більше деталей до запиту
vi: Vui lòng thêm chi tiết truy vấn
zh_hans: 请补充查询条件
zh_hant: 请补充查询条件

# rag.core.service.debug.compressionFallbackFormat
source: Conversation compression failed. Switched to the bounded local summary: %@
ar: فشل ضغط المحادثة. تم التبديل إلى الملخص المحلي المحدود: %@
de: Gesprächskomprimierung fehlgeschlagen. Auf begrenzte lokale Zusammenfassung umgeschaltet: %@
es: La compresión de la conversación falló. Se cambió al resumen local acotado: %@
fr: La compression de la conversation a échoué. Passage au résumé local limité : %@
id: Kompresi percakapan gagal. Beralih ke ringkasan lokal terbatas: %@
it: Compressione della conversazione non riuscita. Passaggio al riepilogo locale limitato: %@
ja: 会話の圧縮に失敗しました。制限付きローカルサマリーに切り替えました: %@
ko: 대화 압축 실패. 제한된 로컬 요약으로 전환했습니다: %@
nl: Gesprekscompressie mislukt. Teruggevallen op de begrensde lokale samenvatting: %@
pl: Kompresja konwersacji nie powiodła się. Przełączono na ograniczone lokalne podsumowanie: %@
pt_br: Falha na compressão da conversa. Alternado para o resumo local limitado: %@
ru: Сжатие разговора не удалось. Переключено на ограниченную локальную сводку: %@
tr: Konuşma sıkıştırması başarısız oldu. Sınırlı yerel özet kullanıma geçildi: %@
uk: Стиснення розмови не вдалося. Переключено на обмежений локальний підсумок: %@
vi: Nén hội thoại thất bại. Đã chuyển sang tóm tắt cục bộ có giới hạn: %@
zh_hans: 会话压缩失败，已回退本地受限摘要：%@
zh_hant: 会话压缩失败，已回退本地受限摘要：%@

# rag.core.service.debug.titleEmpty
source: Conversation title generation failed: the model returned an empty title
ar: فشل إنشاء عنوان المحادثة: أعاد النموذج عنوانًا فارغًا
de: Generierung des Gesprächstitels fehlgeschlagen: Das Modell hat einen leeren Titel zurückgegeben
es: La generación del título de la conversación falló: el modelo devolvió un título vacío
fr: La génération du titre de la conversation a échoué : le modèle a renvoyé un titre vide
id: Pembuatan judul percakapan gagal: model mengembalikan judul kosong
it: Generazione del titolo della conversazione non riuscita: il modello ha restituito un titolo vuoto
ja: 会話タイトルの生成に失敗しました: モデルが空のタイトルを返しました
ko: 대화 제목 생성 실패: 모델이 빈 제목을 반환했습니다
nl: Genereren van gesprekstitel mislukt: het model retourneerde een lege titel
pl: Generowanie tytułu konwersacji nie powiodło się: model zwrócił pusty tytuł
pt_br: Falha na geração do título da conversa: o modelo retornou um título vazio
ru: Не удалось сгенерировать заголовок разговора: модель вернула пустой заголовок
tr: Konuşma başlığı oluşturma başarısız oldu: model boş bir başlık döndürdü
uk: Не вдалося створити назву розмови: модель повернула порожню назву
vi: Tạo tiêu đề hội thoại thất bại: mô hình trả về tiêu đề trống
zh_hans: 会话标题生成失败：模型返回了空标题
zh_hant: 会话标题生成失败：模型返回了空标题

# rag.core.service.debug.titleFailureFormat
source: Conversation title generation failed: %@
ar: فشل إنشاء عنوان المحادثة: %@
de: Generierung des Gesprächstitels fehlgeschlagen: %@
es: La generación del título de la conversación falló: %@
fr: La génération du titre de la conversation a échoué : %@
id: Pembuatan judul percakapan gagal: %@
it: Generazione del titolo della conversazione non riuscita: %@
ja: 会話タイトルの生成に失敗しました: %@
ko: 대화 제목 생성 실패: %@
nl: Genereren van gesprekstitel mislukt: %@
pl: Generowanie tytułu konwersacji nie powiodło się: %@
pt_br: Falha na geração do título da conversa: %@
ru: Не удалось сгенерировать заголовок разговора: %@
tr: Konuşma başlığı oluşturma başarısız oldu: %@
uk: Не вдалося створити назву розмови: %@
vi: Tạo tiêu đề hội thoại thất bại: %@
zh_hans: 会话标题生成失败：%@
zh_hant: 会话标题生成失败：%@

# rag.storage.error.conversationMissing
source: The persisted RAG conversation is missing
ar: محادثة RAG المحفوظة مفقودة
de: Die gespeicherte RAG-Unterhaltung fehlt
es: Falta la conversación RAG persistida
fr: La conversation RAG persistée est introuvable
id: Percakapan RAG yang disimpan tidak ditemukan
it: La conversazione RAG persistente è mancante
ja: 永続化されたRAG会話が見つかりません
ko: 저장된 RAG 대화가 없습니다
nl: Het opgeslagen RAG-gesprek ontbreekt
pl: Brak zapisanej konwersacji RAG
pt_br: A conversa RAG persistente está ausente
ru: Сохранённый RAG-диалог отсутствует
tr: Kalıcı RAG konuşması bulunamadı
uk: Збережена RAG-розмова відсутня
vi: Cuộc hội thoại RAG đã lưu bị thiếu
zh_hans: 持久化的 RAG 会话不存在
zh_hant: 持久化的 RAG 会话不存在

# rag.workspace.addToLibrary.clearSelected
source: Clear
ar: مسح
de: Leeren
es: Limpiar
fr: Effacer
id: Hapus
it: Cancella
ja: クリア
ko: 지우기
nl: Wissen
pl: Wyczyść
pt_br: Limpar
ru: Очистить
tr: Temizle
uk: Очистити
vi: Xóa
zh_hans: 清空
zh_hant: 清空

# rag.workspace.addToLibrary.confirmFormat
source: Add %lld
ar: إضافة %lld
de: %lld hinzufügen
es: Añadir %lld
fr: Ajouter %lld
id: Tambah %lld
it: Aggiungi %lld
ja: %lld を追加
ko: %lld개 추가
nl: %lld toevoegen
pl: Dodaj %lld
pt_br: Adicionar %lld
ru: Добавить %lld
tr: %lld ekle
uk: Додати %lld
vi: Thêm %lld
zh_hans: 加入 %lld 个
zh_hant: 加入 %lld 个

# rag.workspace.addToLibrary.cta
source: Add to Knowledge Base
ar: إضافة إلى قاعدة المعرفة
de: Zur Wissensdatenbank hinzufügen
es: Añadir a la base de conocimiento
fr: Ajouter à la base de connaissances
id: Tambah ke Basis Pengetahuan
it: Aggiungi alla Knowledge Base
ja: ナレッジベースに追加
ko: 지식 베이스에 추가
nl: Toevoegen aan kennisbank
pl: Dodaj do bazy wiedzy
pt_br: Adicionar à Base de Conhecimento
ru: Добавить в базу знаний
tr: Bilgi Tabanına Ekle
uk: Додати до бази знань
vi: Thêm vào Cơ sở tri thức
zh_hans: 添加项目到知识库
zh_hant: 添加项目到知识库

# rag.workspace.addToLibrary.emptyCandidates
source: All Stars are already in the knowledge base
ar: جميع النجوم موجودة بالفعل في قاعدة المعرفة
de: Alle Stars sind bereits in der Wissensdatenbank
es: Todas las estrellas ya están en la base de conocimiento
fr: Toutes les étoiles sont déjà dans la base de connaissances
id: Semua Bintang sudah ada di basis pengetahuan
it: Tutte le stelle sono già nella knowledge base
ja: すべてのスターはすでにナレッジベースにあります
ko: 모든 Star가 이미 지식 베이스에 있습니다
nl: Alle Stars staan al in de kennisbank
pl: Wszystkie gwiazdki są już w bazie wiedzy
pt_br: Todas as estrelas já estão na base de conhecimento
ru: Все звёзды уже в базе знаний
tr: Tüm Yıldızlar zaten bilgi tabanında
uk: Усі зірки вже в базі знань
vi: Tất cả các Star đã có trong cơ sở tri thức
zh_hans: 所有 Stars 都已在知识库中
zh_hant: 所有 Stars 都已在知识库中

# rag.workspace.addToLibrary.emptyCandidatesSubtitle
source: Star more repositories on GitHub, or open the knowledge browser to review what you already added.
ar: قم بتمييز المزيد من المستودعات على GitHub، أو افتح متصفح المعرفة لمراجعة ما أضفته بالفعل.
de: Star mehr Repositories auf GitHub oder öffne den Wissensbrowser, um zu überprüfen, was du bereits hinzugefügt hast.
es: Marque más repositorios en GitHub, o abra el navegador de conocimiento para revisar lo que ya añadió.
fr: Ajoutez d'autres dépôts sur GitHub, ou ouvrez le navigateur de connaissances pour revoir ce que vous avez déjà ajouté.
id: Beri bintang lebih banyak repositori di GitHub, atau buka peramban pengetahuan untuk meninjau yang sudah ditambahkan.
it: Aggiungi altre stelle su GitHub o apri il browser della knowledge base per rivedere ciò che hai già aggiunto.
ja: GitHubでさらにリポジトリをスターするか、ナレッジブラウザを開いて追加済みのものを確認してください。
ko: GitHub에서 저장소를 더 Star하거나, 지식 브라우저를 열어 이미 추가한 내용을 확인하세요.
nl: Markeer meer repositories op GitHub, of open de kennisbankbrowser om te bekijken wat je al hebt toegevoegd.
pl: Oznacz więcej repozytoriów gwiazdką na GitHubie lub otwórz przeglądarkę wiedzy, aby przejrzeć już dodane.
pt_br: Marque mais repositórios com estrela no GitHub ou abra o navegador de conhecimento para revisar o que já foi adicionado.
ru: Добавьте больше репозиториев на GitHub или откройте обозреватель знаний, чтобы просмотреть уже добавленные.
tr: GitHub'da daha fazla depo yıldızlayın veya bilgi tarayıcısını açarak daha önce eklediklerinizi gözden geçirin.
uk: Позначте більше репозиторіїв на GitHub або відкрийте браузер знань, щоб переглянути додані.
vi: Hãy star thêm kho lưu trữ trên GitHub, hoặc mở trình duyệt tri thức để xem lại những gì bạn đã thêm.
zh_hans: 可以再 Star 更多仓库，或打开知识库浏览器查看已入库项目。
zh_hant: 可以再 Star 更多仓库，或打开知识库浏览器查看已入库项目。

# rag.workspace.addToLibrary.emptyFilter
source: No matching repositories
ar: لا توجد مستودعات مطابقة
de: Keine passenden Repositories
es: No hay repositorios coincidentes
fr: Aucun dépôt correspondant
id: Tidak ada repositori yang cocok
it: Nessun repository corrispondente
ja: 一致するリポジトリがありません
ko: 일치하는 저장소 없음
nl: Geen overeenkomende repositories
pl: Brak pasujących repozytoriów
pt_br: Nenhum repositório correspondente
ru: Нет подходящих репозиториев
tr: Eşleşen depo yok
uk: Немає відповідних репозиторіїв
vi: Không có kho lưu trữ phù hợp
zh_hans: 没有匹配的仓库
zh_hant: 没有匹配的仓库

# rag.workspace.addToLibrary.emptyFilterSubtitle
source: Try a different name, language, or description keyword.
ar: جرّب اسمًا أو لغة أو كلمة مفتاحية وصفية مختلفة.
de: Versuche einen anderen Namen, eine andere Sprache oder ein anderes Beschreibungsstichwort.
es: Pruebe con otro nombre, idioma o palabra clave de descripción.
fr: Essayez un autre nom, langage ou mot-clé de description.
id: Coba nama, bahasa, atau kata kunci deskripsi lain.
it: Prova un nome, linguaggio o parola chiave diversa.
ja: 別の名前、言語、または説明キーワードをお試しください。
ko: 다른 이름, 언어 또는 설명 키워드를 시도해 보세요.
nl: Probeer een andere naam, taal of trefwoord in de beschrijving.
pl: Spróbuj innej nazwy, języka lub słowa kluczowego w opisie.
pt_br: Tente um nome, linguagem ou palavra-chave de descrição diferente.
ru: Попробуйте другое имя, язык или ключевое слово в описании.
tr: Farklı bir ad, dil veya açıklama anahtar kelimesi deneyin.
uk: Спробуйте іншу назву, мову або ключове слово в описі.
vi: Thử một tên, ngôn ngữ hoặc từ khóa mô tả khác.
zh_hans: 试试换个仓库名、语言或描述关键词。
zh_hant: 试试换个仓库名、语言或描述关键词。

# rag.workspace.addToLibrary.emptyStars
source: No starred repositories yet
ar: لا توجد مستودعات مميزة بنجمة بعد
de: Noch keine gestarnten Repositories
es: Aún no hay repositorios marcados con estrella
fr: Aucun dépôt avec une étoile pour l'instant
id: Belum ada repositori yang diberi bintang
it: Ancora nessun repository con stella
ja: まだスターしたリポジトリがありません
ko: Star한 저장소가 아직 없습니다
nl: Nog geen gemarkeerde repositories
pl: Brak oznaczonych gwiazdką repozytoriów
pt_br: Nenhum repositório com estrela ainda
ru: Нет отмеченных репозиториев
tr: Henüz yıldızlanmış depo yok
uk: Ще немає позначених зіркою репозиторіїв
vi: Chưa có kho lưu trữ nào được star
zh_hans: 还没有 Star 过的仓库
zh_hant: 还没有 Star 过的仓库

# rag.workspace.addToLibrary.emptyStarsSubtitle
source: Sync your GitHub Stars in the main window first, then come back to add them here.
ar: قم بمزامنة نجوم GitHub في النافذة الرئيسية أولاً، ثم عد لإضافتها هنا.
de: Synchronisiere zuerst deine GitHub-Stars im Hauptfenster und kehre dann zurück, um sie hier hinzuzufügen.
es: Sincronice sus estrellas de GitHub en la ventana principal primero, luego vuelva para añadirlas aquí.
fr: Synchronisez d'abord vos étoiles GitHub dans la fenêtre principale, puis revenez pour les ajouter ici.
id: Sinkronkan Bintang GitHub Anda di jendela utama terlebih dahulu, lalu kembali ke sini untuk menambahkannya.
it: Sincronizza prima le tue stelle GitHub nella finestra principale, poi torna qui per aggiungerle.
ja: 最初にメインウィンドウでGitHubスターを同期してから、ここに追加してください。
ko: 먼저 메인 창에서 GitHub Star를 동기화한 후, 여기로 돌아와 추가하세요.
nl: Synchroniseer eerst je GitHub Stars in het hoofdvenster en kom dan terug om ze hier toe te voegen.
pl: Najpierw zsynchronizuj swoje gwiazdki z GitHub w głównym oknie, a następnie wróć, aby je dodać.
pt_br: Sincronize suas estrelas do GitHub na janela principal primeiro e depois volte para adicioná-las aqui.
ru: Сначала синхронизируйте звёзды GitHub в главном окне, затем вернитесь, чтобы добавить их сюда.
tr: Önce ana pencerede GitHub Yıldızlarınızı senkronize edin, ardından buraya eklemek için geri gelin.
uk: Спочатку синхронізуйте свої зірки GitHub у головному вікні, а потім поверніться, щоб додати їх сюди.
vi: Đồng bộ GitHub Stars của bạn trong cửa sổ chính trước, sau đó quay lại để thêm chúng vào đây.
zh_hans: 请先在主窗口同步 GitHub Stars，再回到这里添加。
zh_hant: 请先在主窗口同步 GitHub Stars，再回到这里添加。

# rag.workspace.addToLibrary.loadFailed
source: Couldn't load repositories
ar: تعذر تحميل المستودعات
de: Repositories konnten nicht geladen werden
es: No se pudieron cargar los repositorios
fr: Impossible de charger les dépôts
id: Tidak dapat memuat repositori
it: Impossibile caricare i repository
ja: リポジトリを読み込めませんでした
ko: 저장소를 불러올 수 없습니다
nl: Kon repositories niet laden
pl: Nie udało się załadować repozytoriów
pt_br: Não foi possível carregar os repositórios
ru: Не удалось загрузить репозитории
tr: Depolar yüklenemedi
uk: Не вдалося завантажити репозиторії
vi: Không thể tải kho lưu trữ
zh_hans: 加载仓库失败
zh_hant: 加载仓库失败

# rag.workspace.addToLibrary.openHelp
source: Choose starred repositories to add to the knowledge base
ar: اختر المستودعات المميزة بنجمة لإضافتها إلى قاعدة المعرفة
de: Wähle gestarnte Repositories aus, die zur Wissensdatenbank hinzugefügt werden sollen
es: Elija repositorios marcados con estrella para añadir a la base de conocimiento
fr: Choisissez les dépôts avec une étoile à ajouter à la base de connaissances
id: Pilih repositori yang diberi bintang untuk ditambahkan ke basis pengetahuan
it: Scegli i repository con stella da aggiungere alla knowledge base
ja: ナレッジベースに追加するスター付きリポジトリを選択してください
ko: 지식 베이스에 추가할 Star한 저장소를 선택하세요
nl: Kies gemarkeerde repositories om aan de kennisbank toe te voegen
pl: Wybierz oznaczone gwiazdką repozytoria, aby dodać je do bazy wiedzy
pt_br: Escolha repositórios com estrela para adicionar à base de conhecimento
ru: Выберите отмеченные репозитории для добавления в базу знаний
tr: Bilgi tabanına eklemek için yıldızlanmış depoları seçin
uk: Виберіть позначені зіркою репозиторії для додавання до бази знань
vi: Chọn các kho lưu trữ đã star để thêm vào cơ sở tri thức
zh_hans: 从 Stars 中选择要加入知识库的项目
zh_hant: 从 Stars 中选择要加入知识库的项目

# rag.workspace.addToLibrary.searchPlaceholder
source: Search repositories
ar: البحث في المستودعات
de: Repositories durchsuchen
es: Buscar repositorios
fr: Rechercher des dépôts
id: Cari repositori
it: Cerca repository
ja: リポジトリを検索
ko: 저장소 검색
nl: Zoek repositories
pl: Szukaj repozytoriów
pt_br: Pesquisar repositórios
ru: Поиск репозиториев
tr: Depo ara
uk: Пошук репозиторіїв
vi: Tìm kiếm kho lưu trữ
zh_hans: 搜索仓库
zh_hant: 搜索仓库

# rag.workspace.addToLibrary.selectVisible
source: Select All Visible
ar: تحديد كل المرئي
de: Alle sichtbaren auswählen
es: Seleccionar todos los visibles
fr: Sélectionner tout ce qui est visible
id: Pilih Semua yang Terlihat
it: Seleziona tutti i visibili
ja: 表示中のすべてを選択
ko: 보이는 항목 모두 선택
nl: Selecteer alle zichtbare
pl: Zaznacz wszystkie widoczne
pt_br: Selecionar todos visíveis
ru: Выбрать все видимые
tr: Tüm Görünürleri Seç
uk: Вибрати всі видимі
vi: Chọn tất cả đang hiển thị
zh_hans: 全选可见
zh_hant: 全选可见

# rag.workspace.addToLibrary.stats
source: %lld selected · %lld shown
ar: تم تحديد %lld · %lld معروض
de: %lld ausgewählt · %lld angezeigt
es: %lld seleccionados · %lld mostrados
fr: %lld sélectionné(s) · %lld affiché(s)
id: %lld dipilih · %lld ditampilkan
it: %lld selezionati · %lld mostrati
ja: %lld 選択中 · %lld 表示中
ko: %lld개 선택됨 · %lld개 표시됨
nl: %lld geselecteerd · %lld weergegeven
pl: %lld wybrano · %lld pokazano
pt_br: %lld selecionado(s) · %lld exibido(s)
ru: Выбрано %lld · Показано %lld
tr: %lld seçildi · %lld gösteriliyor
uk: Вибрано %lld · показано %lld
vi: %lld đã chọn · %lld đang hiển thị
zh_hans: 已选 %lld · 显示 %lld
zh_hant: 已选 %lld · 显示 %lld
